app/controllers/bands_controller.rb

  def index
    @winner = Band.find(:first, :order => "num_votes DESC")
---
SELECT * FROM `bands` WHERE (id != 1) ORDER BY num_votes DESC
SELECT * FROM `votes` WHERE (`votes`.band_id = 1)

  def create
    @band = Band.new(params[:band])

    band_names = []
    doc = Hpricot.XML(open('http://ws.audioscrobbler.com/2.0/?method=artist.search&artist=' + @band.url_escape + '&api_key=' + LASTFM_API_KEY))

    (doc/"artist/name").each do |artist_name|
       band_names << artist_name.inner_html
    end


    if band_names.include?(@band.name)
---
INSERT INTO `bands` (`name`, `permalink`, `updated_at`, `num_up_votes`, `rank`, `num_votes`, `num_down_votes`, `created_at`) VALUES('Jay-Z', 'jay-z', '2009-02-15 07:36:49', 1, 0, 1, 0, '2009-02-15 07:36:49')
SELECT `bands`.id FROM `bands` WHERE (`bands`.`name` = 'Crash Test Dummies') LIMIT 1

  def show
    @band = Band.find_by_permalink(params[:id])
    @comments = @band.comments.find(:all, :order => "created_at DESC")
---
SELECT * FROM `bands` WHERE (`bands`.`permalink` = 'limp-bizkit') LIMIT 1
SELECT * FROM `bands` WHERE (`bands`.`id` = 4)
SELECT * FROM `comments` WHERE (`comments`.band_id = 4) ORDER BY created_at DESC

  def up
    band = Band.find_by_permalink(params[:id])
    vote = Vote.find(:all, :conditions => "user_id = #{@user.id} AND band_id = #{band.id}")
    if vote.length == 0
      vote = Vote.new(:band_id => band.id, :user_id => @user.id, :direction => 1)
      vote.save
---
SELECT * FROM `bands` WHERE (`bands`.`permalink` = 'limp-bizkit') LIMIT 1
SELECT * FROM `bands` WHERE (`bands`.`id` = 2)
SELECT * FROM `votes` WHERE (user_id = 1 AND band_id = 1)
INSERT INTO `votes` (`updated_at`, `user_id`, `band_id`, `direction`, `created_at`) VALUES('2009-02-11 07:14:06', 1, 4, 1, '2009-02-11 07:14:06')
UPDATE `bands` SET `num_votes` = 2, `num_up_votes` = 2, `updated_at` = '2009-02-15 08:04:37' WHERE `id` = 4

  def down
    band = Band.find_by_permalink(params[:id])
    vote = Vote.find(:all, :conditions => "user_id = #{@user.id} AND band_id = #{band.id}")
    if vote.length == 0
      vote = Vote.new(:band_id => band.id, :user_id => @user.id, :direction => -1)
      vote.save
---
SELECT * FROM `bands` WHERE (`bands`.`permalink` = 'limp-bizkit') LIMIT 1
SELECT * FROM `bands` WHERE (`bands`.`id` = 2)
SELECT * FROM `votes` WHERE (user_id = 1 AND band_id = 4)
INSERT INTO `votes` (`updated_at`, `user_id`, `band_id`, `direction`, `created_at`) VALUES('2009-02-11 07:17:18', 1, 1, -1, '2009-02-11 07:17:18')
UPDATE `bands` SET `num_votes` = 0, `num_down_votes` = 1, `updated_at` = '2009-02-15 07:54:22' WHERE `id` = 3