app/controllers/comments_controller.rb

  def create
    @band = Band.find_by_permalink(params[:band_id])
    @comment = @band.comments.new(params[:comment])

    if @comment.save
---
SELECT * FROM `bands` WHERE (`bands`.`permalink` = 'crash-test-dummies') LIMIT 1
INSERT INTO `comments` (`name`, `updated_at`, `body`, `website`, `user_id`, `band_id`, `email`, `created_at`) VALUES('Anonymous Coward', '2009-02-14 04:42:43', 'Test', '', NULL, NULL, 'jared.online@gmail.com', '2009-02-14 04:42:43')